hydevcode/sdk-bsp-psoc_e84-edgi-talk/libraries/components/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
/*
 * (c) 2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG. All rights reserved.
 * This software, associated documentation and materials ("Software") is
 * owned by Infineon Technologies AG or one of its affiliates ("Infineon")
 * and is protected by and subject to worldwide patent protection, worldwide
 * copyright laws, and international treaty provisions. Therefore, you may use
 * this Software only as provided in the license agreement accompanying the
 * software package from which you obtained this Software. If no license
 * agreement applies, then any use, reproduction, modification, translation, or
 * compilation of this Software is prohibited without the express written
 * permission of Infineon.
 *
 * Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
 * IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
 * INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
 * THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
 * SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
 * Infineon reserves the right to make changes to the Software without notice.
 * You are responsible for properly designing, programming, and testing the
 * functionality and safety of your intended application of the Software, as
 * well as complying with any legal requirements related to its use. Infineon
 * does not guarantee that the Software will be free from intrusion, data theft
 * or loss, or other breaches ("Security Breaches"), and Infineon shall have
 * no liability arising out of any Security Breaches. Unless otherwise
 * explicitly approved by Infineon, the Software may not be used in any
 * application where a failure of the Product or any consequences of the use
 * thereof can reasonably be expected to result in personal injury.
 */

/**
* @file cy_wps.c
* @brief Cypress WPS implementation
*/

/******************************************************
 *            Includes
 ******************************************************/

#include "cy_wps.h"

#include "cy_eapol.h"
#include "cy_wps_common.h"
#include "cy_wps_constants.h"
#include "cy_wps_structures.h"
#include "string.h"
#include "stdlib.h"
#include "cy_wcm_log.h"
#include "whd_wifi_api.h"
#include "cy_wps_memory.h"
#include "whd_types_int.h"
#include "whd_events_int.h"
#include "whd_network_types.h"
#include "whd_cdc_bdc.h"
#include "whd_buffer_api.h"
#include "whd_int.h"
#include "whd_debug.h"
#include "cy_wifimwcore_eapol.h"
#include "whd_proto.h"
/******************************************************
 *             Constants
 ******************************************************/

#define EAPOL_HEADER_SPACE                (sizeof(ether_header_t) + sizeof(eapol_header_t))
#define WL_CHANSPEC_CHAN_MASK             0x00ff
#define WL_CHANSPEC_BAND_2G               0x2000
#define WPS_THREAD_STACK_SIZE             (4*1024)
#define AUTHORIZED_MAC_LIST_LENGTH        (1)
#define ACTIVE_WPS_WORKSPACE_ARRAY_SIZE   (1)

#define DOT11_IE_ID_VENDOR_SPECIFIC       ( 221 )
#define KDK_REQUIRED_CRYPTO_MATERIAL      (CY_WPS_CRYPTO_MATERIAL_ENROLLEE_NONCE | CY_WPS_CRYPTO_MATERIAL_REGISTRAR_NONCE | CY_WPS_CRYPTO_MATERIAL_ENROLLEE_MAC_ADDRESS)

/* Time related constants */
#define SECONDS                      (1000)
#define MINUTES                      (60 * SECONDS)
#define WPS_TOTAL_MAX_TIME           (120*1000)  /* In milliseconds */
#define DUAL_BAND_WPS_SCAN_TIMEOUT   (5000)      /* In milliseconds */
#define SINGLE_BAND_WPS_SCAN_TIMEOUT (2500)      /* In milliseconds. 4390 takes longest time to complete scan. */
#define DEFAULT_WPS_JOIN_TIMEOUT     (1500)
#define WPS_PBC_OVERLAP_WINDOW       (120*1000) /* In milliseconds */

/******************************************************
 *             Macros
 ******************************************************/

#define IF_TO_WORKSPACE( interface )   ( active_wps_workspaces[0] )     /* STA = 0,  AP = 1 */

/******************************************************
 *             Local Structures
 ******************************************************/

typedef struct
{
    cy_host_workspace_t host_workspace;

    union
    {
        struct
        {
            cy_wps_credential_t*     enrollee_output;
            uint16_t*                enrollee_output_length;
            uint16_t                 stored_credential_count;
            cy_wps_ap_t              ap_list[AP_LIST_SIZE];
            uint8_t                  ap_list_counter;
            cy_wps_scan_handler_t    scan_handler_ptr;
        } enrollee;
        struct
        {
            const cy_wps_credential_t* ap_details;
            whd_mac_t                  authorized_mac_list[AUTHORIZED_MAC_LIST_LENGTH];
        } registrar;
    } stuff;
} cy_wps_workspace_t;

typedef struct
{
    cy_time_t     probe_request_rx_time;
    whd_mac_t     probe_request_mac;
} cy_wps_pbc_overlap_record_t;

typedef void (*cy_wps_pbc_probreq_notify_callback_t)(whd_mac_t mac);

/******************************************************
 *             Static Variables
 ******************************************************/
static whd_scan_result_t scan_result;

/* Active WPS workspaces.
 * Need to have one for each interface, but for now as only STA is supported. added only one */
static cy_wps_agent_t* active_wps_workspaces[ACTIVE_WPS_WORKSPACE_ARRAY_SIZE] = {0};

static       cy_wps_pbc_overlap_record_t pbc_overlap_array[2] = { { 0 } };
static       cy_wps_pbc_overlap_record_t last_pbc_enrollee    = { 0 };
static const whd_event_num_t          wps_events[]         = { WLC_E_PROBREQ_MSG, WLC_E_NONE };
const        uint32_t wps_m2_timeout                       = WPS_PUBLIC_KEY_MESSAGE_TIMEOUT;

static       cy_wps_pbc_probreq_notify_callback_t pbc_probreq_notify_callback;

/******************************************************
 *             Static Function Prototypes
 ******************************************************/

static void           cy_wps_thread                    ( cy_thread_arg_t arg );
static void           cy_wps_whd_scan_result_handler   ( whd_scan_result_t** result_ptr, void* user_data, whd_scan_status_t status );
static void*          cy_wps_softap_event_handler      ( whd_interface_t interface, const whd_event_header_t* event_header, const uint8_t* event_data, /*@returned@*/ void* handler_user_data );
#ifdef WCM_ENABLE_WPS_REGISTRAR
static cy_rslt_t      cy_wps_internal_pbc_overlap_check( const whd_mac_t* mac );
#endif
static void           cy_network_process_wps_eapol_data( /*@only@*/ whd_interface_t interface, whd_buffer_t buffer );
static tlv8_header_t* cy_wps_parse_dot11_tlvs          ( const tlv8_header_t* tlv_buf, uint32_t buflen, dot11_ie_id_t key );

/******************************************************
 *             Function definitions
 ******************************************************/

cy_rslt_t cy_wps_init(cy_wps_agent_t* workspace, const cy_wps_device_detail_t* details, cy_wps_agent_type_t type, whd_interface_t interface )
{
    cy_wps_workspace_t* host_workspace;
    cy_rslt_t result;

