hydevcode/sdk-bsp-psoc_e84-edgi-talk/libraries/components/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
    if ( workspace->is_p2p_enrollee != 1 && workspace->is_p2p_registrar != 1)
    {
        memset(workspace, 0, sizeof(cy_wps_agent_t));
    }
    host_workspace = cy_wps_malloc("wps", sizeof(cy_wps_workspace_t));
    if (host_workspace == NULL)
    {
        return CY_RSLT_WPS_OUT_OF_HEAP_SPACE;
    }
    memset(host_workspace, 0, sizeof(cy_wps_workspace_t));
    workspace->wps_host_workspace = host_workspace;

#ifdef RTOS_USE_STATIC_THREAD_STACK
    host_workspace->host_workspace.thread_stack = cy_wps_malloc("wps stack", WPS_THREAD_STACK_SIZE);
    if (host_workspace->host_workspace.thread_stack == NULL)
    {
        cy_wps_free(workspace->wps_host_workspace);
        workspace->wps_host_workspace = NULL;
        return WPS_ERROR_WPS_STACK_MALLOC_FAIL;
    }
    memset( host_workspace->host_workspace.thread_stack, 0, WPS_THREAD_STACK_SIZE );
#else
    host_workspace->host_workspace.thread_stack = NULL;
#endif
    host_workspace->host_workspace.interface = interface;
    workspace->interface      = interface;
    workspace->agent_type     = type;
    workspace->device_details = details;
    workspace->wps_result     = CY_RSLT_WPS_NOT_STARTED;
    if ( workspace->is_p2p_enrollee != 1 )
    {
        workspace->wps_mode           = CY_WPS_PIN_MODE;
        workspace->device_password_id = CY_WPS_DEFAULT_DEVICEPWDID;
    }

    result = cy_rtos_init_queue(&host_workspace->host_workspace.event_queue, 10, sizeof(cy_event_message_t));
    if ( result != CY_RSLT_SUCCESS )
    {
        return result;
    }

    cy_wps_init_workspace( workspace );

    cy_wifimwcore_eapol_register_receive_handler( (cy_wifimwcore_eapol_packet_handler_t) cy_network_process_wps_eapol_data );

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wps_management_set_event_handler( cy_wps_agent_t* workspace, bool enable )
{
    whd_result_t   result;
    uint16_t       event_index;

    /* Add WPS event handler */
    if ( enable == true )
    {
        result = whd_management_set_event_handler(workspace->interface, wps_events, cy_wps_softap_event_handler, workspace, &event_index);
    }
    else
    {
        result = whd_management_set_event_handler( workspace->interface, wps_events, NULL, workspace, &event_index );
    }

    if ( result != WHD_SUCCESS )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Error setting event handler %u\r\n", (unsigned int)result);
    }
    return (cy_rslt_t) result;
}

cy_rslt_t cy_wps_get_result( cy_wps_agent_t* workspace )
{
    switch ( workspace->wps_result)
    {
        case CY_RSLT_WPS_COMPLETE:
            return CY_RSLT_SUCCESS;

        case CY_RSLT_WPS_PBC_OVERLAP:
            return CY_RSLT_WPS_PBC_OVERLAP;

        case CY_RSLT_WPS_ERROR_RECEIVED_WEP_CREDENTIALS:
            return CY_RSLT_WPS_ERROR_RECEIVED_WEP_CREDENTIALS;

        default:
            return CY_RSLT_WPS_ERROR;
    }
}

cy_rslt_t cy_wps_deinit( cy_wps_agent_t* workspace )
{
    cy_host_workspace_t* host_workspace = &((cy_wps_workspace_t*) workspace->wps_host_workspace)->host_workspace;

    cy_wps_deinit_workspace(workspace);

    if ( host_workspace != NULL )
    {
        /* Delete the WPS thread */
        if ( workspace->wps_result != CY_RSLT_WPS_NOT_STARTED )
        {
            if( host_workspace->thread != NULL )
           {
                cy_rtos_terminate_thread( &host_workspace->thread );
            }
        }

        if ( host_workspace->thread_stack != NULL )
        {
            cy_wps_free( host_workspace->thread_stack );
            host_workspace->thread_stack = NULL;
        }

        cy_rtos_deinit_queue( &host_workspace->event_queue );
        cy_wps_free( host_workspace );
        workspace->wps_host_workspace = NULL;
    }
    cy_wifimwcore_eapol_register_receive_handler( NULL );
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wps_start( cy_wps_agent_t* workspace, cy_wps_mode_t mode, const char* password, cy_wps_credential_t* credentials, uint16_t* credential_length )
{
    cy_rslt_t result;
    cy_host_workspace_t* host_workspace = &((cy_wps_workspace_t*) workspace->wps_host_workspace)->host_workspace;

    switch ( mode )
    {
        case CY_WPS_PBC_MODE:
            workspace->device_password_id = CY_WPS_PUSH_BTN_DEVICEPWDID;
            break;

        case CY_WPS_PIN_MODE:
            workspace->device_password_id = CY_WPS_DEFAULT_DEVICEPWDID;
            break;

        default:
            break;
    }

#ifdef WCM_ENABLE_WPS_REGISTRAR
    if ( ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT ) &&
         ( cy_wps_internal_pbc_overlap_check( NULL ) == CY_RSLT_WPS_PBC_OVERLAP ) && ( mode == CY_WPS_PBC_MODE ) )
    {
        return CY_RSLT_WPS_PBC_OVERLAP;
    }
#endif

    result = cy_wps_internal_init( workspace, (uint32_t) workspace->interface, mode, password, credentials, credential_length );
    if ( result == CY_RSLT_SUCCESS )
    {
        if ( cy_rtos_create_thread( &host_workspace->thread, cy_wps_thread, "wps", host_workspace->thread_stack, WPS_THREAD_STACK_SIZE, CY_RTOS_PRIORITY_ABOVENORMAL, (cy_thread_arg_t) workspace ) != CY_RSLT_SUCCESS )
        {
            return result;
        }
    }
    cy_rtos_delay_milliseconds(10); /* Delay required to allow the WPS thread to run */

    return result;
}

#ifdef WCM_ENABLE_P2P
cy_rslt_t cy_p2p_wps_start( cy_wps_agent_t* workspace )
{
    cy_rslt_t result;
    cy_host_workspace_t* host_workspace = &((cy_wps_workspace_t*) workspace->wps_host_workspace)->host_workspace;

    if ( ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT ) &&
         ( cy_wps_internal_pbc_overlap_check( NULL ) == CY_RSLT_WPS_PBC_OVERLAP ) && ( workspace->wps_mode == CY_WPS_PBC_MODE ) )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "PBC overlap detected. Wait and try again later\r\n");
        return CY_RSLT_WPS_PBC_OVERLAP;
    }

    result = cy_rtos_create_thread( &host_workspace->thread, cy_wps_thread, "wps", host_workspace->thread_stack, WPS_THREAD_STACK_SIZE, (cy_thread_priority_t)RTOS_HIGHER_PRIORTIY_THAN(RTOS_DEFAULT_THREAD_PRIORITY), (cy_thread_arg_t) workspace );

    return result;
}
#endif

cy_rslt_t cy_wps_restart( cy_wps_agent_t* workspace )
{
    cy_rtos_get_time( &workspace->start_time );
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wps_reset_registrar( cy_wps_agent_t* workspace, whd_mac_t* mac )
{
    if ( workspace->current_main_stage == CY_WPS_IN_WPS_HANDSHAKE )
    {
        if ( memcmp( mac, &workspace->their_data.mac_address, sizeof(whd_mac_t)) == 0 )
        {
            workspace->current_sub_stage = CY_WPS_EAP_START;
            workspace->current_main_stage = CY_WPS_INITIALISING;
            workspace->available_crypto_material = KDK_REQUIRED_CRYPTO_MATERIAL;
        }
    }

    return CY_RSLT_SUCCESS;
}

