hydevcode/sdk-bsp-psoc_e84-edgi-talk/libraries/components/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
    memcpy(&workspace->band_list, (uint32_t*) whd_buffer_get_current_piece_data_pointer(host->host_workspace.interface->whd_driver, response), sizeof(whd_band_list_t));
    whd_buffer_release(host->host_workspace.interface->whd_driver, response, WHD_NETWORK_RX);

    if ( workspace->band_list.number_of_bands == 1 )
    {
        if ( workspace->band_list.number_of_bands == 1 )
        {
            scan_timeout = SINGLE_BAND_WPS_SCAN_TIMEOUT;
        }
    }
    memset(&scan_result, 0, sizeof(whd_scan_result_t) );

    do
    {
        ++attempts;
        ret = (cy_rslt_t) whd_wifi_scan(interface, WHD_SCAN_TYPE_ACTIVE, WHD_BSS_TYPE_INFRASTRUCTURE, 0, 0, chlist, &extparam, cy_wps_whd_scan_result_handler, &scan_result, workspace);
    } while ( ret != CY_RSLT_SUCCESS && attempts < 5 );

    if (ret != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "WPS scan failure\r\n");
        cy_host_start_timer( host, 100 );
    }
    else
    {
        cy_host_start_timer( host, scan_timeout );
    }
}

void cy_wps_host_get_authorized_macs( void* workspace, whd_mac_t** mac_list, uint8_t* mac_list_length )
{
    cy_wps_workspace_t* host = (cy_wps_workspace_t*)workspace;
    *mac_list = &host->stuff.registrar.authorized_mac_list[0];
    *mac_list_length = 1;
}

static void* cy_wps_softap_event_handler( whd_interface_t interface, const whd_event_header_t* event_header, const uint8_t* event_data, /*@returned@*/ void* handler_user_data )
{
    const uint8_t* data;
    uint32_t       length;
    tlv8_data_t*   tlv8;
    cy_wps_agent_t*   workspace;

    if ( ( event_header == NULL ) || ( event_data == NULL ) || ( handler_user_data == NULL ) )
    {
        return handler_user_data;
    }
    workspace = (cy_wps_agent_t*)handler_user_data;
    length    = event_header->datalen;

    if ( ( length <= 24 ) || ( workspace == NULL ) )
    {
        return handler_user_data;
    }
    length -= 24; /* XXX length of management frame MAC header */
    data = event_data + 24;

    switch ( event_header->event_type )
    {
        case WLC_E_PROBREQ_MSG:
            if ( event_header->status == WLC_E_STATUS_SUCCESS )
            {
                do
                {
                    /* Scan result for vendor specific IE */
                    tlv8 = tlv_find_tlv8( data, length, DOT11_IE_ID_VENDOR_SPECIFIC );
                    if ( tlv8 == NULL )
                    {
                        break;
                    }
                    /* Check if the TLV we've found is outside the bounds of the scan result length. i.e. Something is bad */
                    if ((( (uint8_t*) tlv8 - data ) + tlv8->length + sizeof(tlv8_header_t)) > length)
                    {
                        break;
                    }

                    length -= ( (uint8_t*) tlv8 - data ) + tlv8->length + sizeof(tlv8_header_t);
                    data = (uint8_t*) tlv8 + tlv8->length + sizeof(tlv8_header_t);

                    /* Verify extension is WPS extension */
                    if ( memcmp( tlv8->data, WPS_OUI, 3 ) == 0 && tlv8->data[3] == WPS_OUI_TYPE )
                    {
                        /* Look for pwd ID, check if it is the same mode that we are */
                        tlv16_uint16_t* pwd_id = (tlv16_uint16_t*) tlv_find_tlv16( &tlv8->data[4], tlv8->length - 4, WPS_ID_DEVICE_PWD_ID );
                        if ( pwd_id != NULL && cy_hton16( pwd_id->data ) == CY_WPS_PUSH_BTN_DEVICEPWDID )
                        {
                            cy_wps_update_pbc_overlap_array( workspace, (whd_mac_t*)(event_data + 10) );
                        }
                    }
                } while ( ( tlv8 != NULL ) && ( length > 0 ) );
            }
            break;

        default:
            break;
    }

    return handler_user_data;
}

/* Note that this function may be called from the Wiced thread context */
void cy_wps_update_pbc_overlap_array(cy_wps_agent_t* workspace, const whd_mac_t* mac_address )
{
    int i;
    cy_time_t              rx_time;
    cy_event_message_t   message;
    cy_host_workspace_t* host = &((cy_wps_workspace_t*)workspace->wps_host_workspace)->host_workspace;
    whd_mac_t             mac;

    cy_rtos_get_time(&rx_time);
    memcpy( &mac, mac_address, sizeof( whd_mac_t ) );

    /* If the MAC address is the same as the last enrollee give it 5 seconds to stop asserting PBC mode */
    if ( ( memcmp( &mac, (char*) &last_pbc_enrollee.probe_request_mac, sizeof(whd_mac_t) ) == 0 ) &&
         ( ( rx_time - last_pbc_enrollee.probe_request_rx_time ) <= WPS_PBC_MODE_ASSERTION_DELAY ) )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Received probe request asserting PBC mode from last enrollee\r\n");
        goto return_without_notify;
    }

    /* If the MAC address is already in the array update the rx time */
    for ( i = 0; i < 2; i++ )
    {
        if (memcmp(&mac, (char*)&pbc_overlap_array[i].probe_request_mac, sizeof(whd_mac_t)) == 0)
        {
            /* Notify the application that a probe request has been received, but only do this every few seconds. */
            if ( ( rx_time - pbc_overlap_array[i].probe_request_rx_time ) <= WPS_PBC_NOTIFICATION_DELAY )
            {
                pbc_overlap_array[i].probe_request_rx_time = rx_time;
                goto return_without_notify;
            }
            else
            {
                pbc_overlap_array[i].probe_request_rx_time = rx_time;
                goto return_with_notify;
            }
        }
    }

    /* If this is a new MAC address replace oldest existing entry with this MAC address */
    if ( pbc_overlap_array[0].probe_request_rx_time == 0 ) /* Initial condition for array record 0 */
    {
        memcpy((char*)&pbc_overlap_array[0].probe_request_mac, &mac, sizeof(whd_mac_t));
        pbc_overlap_array[0].probe_request_rx_time = rx_time;
    }
    else if ( pbc_overlap_array[1].probe_request_rx_time == 0 ) /* Initial condition for array record 1 */
    {
        memcpy((char*)&pbc_overlap_array[1].probe_request_mac, &mac, sizeof(whd_mac_t));
        pbc_overlap_array[1].probe_request_rx_time = rx_time;
    }
    else if ( pbc_overlap_array[0].probe_request_rx_time <= pbc_overlap_array[1].probe_request_rx_time )
    {
        memcpy((char*)&pbc_overlap_array[0].probe_request_mac, &mac, sizeof(whd_mac_t));
        pbc_overlap_array[0].probe_request_rx_time = rx_time;
    }
    else
    {
        memcpy((char*)&pbc_overlap_array[1].probe_request_mac, &mac, sizeof(whd_mac_t));
    }

