hydevcode/sdk-bsp-psoc_e84-edgi-talk/libraries/components/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps.c
return_with_notify:
    /* This event is only so that the user of the SoftAP (not group owner) can be notified of PBC overlap during the Registrar WPS handshake.
     * If the event queue is full we can safely skip this event so the wait time is zero.
     */
    if ( ( workspace->is_p2p_enrollee == 0 ) && ( workspace->is_p2p_registrar == 0 ) &&
            ( workspace->wps_result == CY_RSLT_WPS_IN_PROGRESS ) && ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT ) &&
            ( workspace->wps_mode == CY_WPS_PBC_MODE ))
    {
        message.event_type  = CY_WPS_EVENT_PBC_OVERLAP_NOTIFY_USER;
        message.data.packet = &mac;
        if (cy_rtos_put_queue(&host->event_queue, &message, 0, false) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "No room in the WPS event queue\r\n");
        }
    }

return_without_notify:
    return;
}

#ifdef WCM_ENABLE_WPS_REGISTRAR
void wps_register_pbc_probreq_callback( cy_wps_pbc_probreq_notify_callback_t pbc_probreq_callback )
{
    pbc_probreq_notify_callback = pbc_probreq_callback;
}
#endif

void cy_wps_pbc_overlap_array_notify( const whd_mac_t* mac )
{
    if ( pbc_probreq_notify_callback != NULL )
    {
        whd_mac_t probreq_mac;
        memcpy(&probreq_mac, mac, sizeof(whd_mac_t));
        pbc_probreq_notify_callback(probreq_mac);
    }
}

void cy_wps_clear_pbc_overlap_array( void )
{
    memset( (char*)pbc_overlap_array, 0, sizeof(pbc_overlap_array) );
}

cy_rslt_t cy_wps_pbc_overlap_check(const whd_mac_t* mac )
{
    cy_time_t detection_window_start;
    cy_time_t time_now;

    /* Detection window starts at 0, or 120 seconds prior to now if the host has been up for more than 120 seconds */
    detection_window_start = 0;
    cy_rtos_get_time(&time_now);
    if ( time_now > WPS_PBC_OVERLAP_WINDOW )
    {
        detection_window_start = time_now - WPS_PBC_OVERLAP_WINDOW;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PBC overlap detection window start %u\r\n", (unsigned int)detection_window_start);

    /* This tests the case where M1 has arrived and there may or may not be a probe request from the same enrollee
     * in the detection array, but there is a probe request from another enrollee.
     */
    if ( mac != NULL )
    {
        if ( ( memcmp( mac, (char*) &pbc_overlap_array[0].probe_request_mac, sizeof(whd_mac_t) ) != 0 ) &&
             ( pbc_overlap_array[0].probe_request_rx_time > detection_window_start ) )
        {
            return CY_RSLT_WPS_PBC_OVERLAP;
        }

        if ( ( memcmp( mac, (char*) &pbc_overlap_array[1].probe_request_mac, sizeof(whd_mac_t) ) != 0 ) &&
             ( pbc_overlap_array[1].probe_request_rx_time > detection_window_start ) )
        {
            return CY_RSLT_WPS_PBC_OVERLAP;
        }
        else
        {
            return CY_RSLT_SUCCESS;
        }
    }
    else
    {
        /* This tests the simple case where two enrollees have been probing during the detection window */
        if ( ( pbc_overlap_array[0].probe_request_rx_time > detection_window_start ) &&
             ( pbc_overlap_array[1].probe_request_rx_time > detection_window_start ) )
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PBC overlap array entry 0 %u\r\n", (unsigned int)pbc_overlap_array[0].probe_request_rx_time);
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PBC overlap array entry 1 %u\r\n", (unsigned int)pbc_overlap_array[1].probe_request_rx_time);
            return CY_RSLT_WPS_PBC_OVERLAP;
        }
    }

    return CY_RSLT_SUCCESS;
}

void cy_wps_record_last_pbc_enrollee( const whd_mac_t* mac )
{
    memcpy((char*)&last_pbc_enrollee.probe_request_mac, mac, sizeof(whd_mac_t));
    cy_rtos_get_time( &last_pbc_enrollee.probe_request_rx_time );
}

void cy_wps_register_result_callback( cy_wps_agent_t* workspace, void (*wps_result_callback)(cy_rslt_t*) )
{
    workspace->cy_wps_result_callback = wps_result_callback;
}

void cy_wps_register_internal_result_callback( cy_wps_agent_t* workspace, void (*wps_internal_result_callback)(cy_rslt_t*) )
{
    workspace->cy_wps_internal_result_callback = wps_internal_result_callback;
}

/* Note that there is an identical function in wwd_wifi.c which can't be used currently because making it non-static causes build errors related to the tlv8 structs. */
static tlv8_header_t* cy_wps_parse_dot11_tlvs( const tlv8_header_t* tlv_buf, uint32_t buflen, dot11_ie_id_t key )
{

    return (tlv8_header_t*) tlv_find_tlv8( (const uint8_t*) tlv_buf, buflen, key );
}
